<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 验证码配置
// +----------------------------------------------------------------------
return [

	'codeSet'	=> '2345678abcdefhijkmnpqrstuvwxyzABCDEFGHJKLMNPQRTUVWXY',	//字符码集合
    'useCurve'  => false,	// 是否画混淆曲线
	'length'	=> 4,	// 验证码位数
	'expire'	=> 1800,	//验证码过期时间（s）
	'useZh'		=> false,	// 使用中文验证码
	'useImgBg'	=> false,	// 使用背景图片
	'fontSize'	=> 25,		//字体大小
	'bg'		=> [243, 251, 254],
	'math'		=> false,
];
