<?php

namespace app\admin\service;

class ActionSetService
{
	
	public static function actionList(){
		
		$list=[
			1 => '数据列表',
			3 => '添加',
			4 => '修改',
			5 => '删除',
			6 => '设置指定值 如修改状态',
			16=> '修改排序、或开关操作',
			7 => '数值加',
			8 => '数值减',
			9 => '重置密码',
			10=> '跳转链接',
			11=> '弹窗链接',
			12=> '数据导出',
			13=> '数据导入',
			14=> '批量修改',
			15=> '查看数据',
			
		];
		
        return $list;
	}
	
	public static function apiList(){		
		$list=[
			1 => '数据列表',
			3 => '添加',
			4 => '修改',
			5 => '删除',
			6 => '设置指定值 如修改状态',
			7 => '数值加',
			8 => '数值减',
			9 => '重置密码',
			12=> '数据导出',
			15=> '查看数据',
			17=> '账号密码登录',
			19=> '手机号登录',
			18=> '发送短信验证码',
			20=> '微信公众号订单支付',
			21=> '微信公众号充值',
			22=> '微信小程序订单支付',
			23=> '微信小程序充值',
			24=> '微信扫码订单支付',
			25=> '微信扫码充值',
			26=> '微信支付查询',
			27=> '微信公众号登录',
			28=> '微信小程序登录',
			29=> '支付宝小程序登录',
			30=> '支付宝扫码订单支付',
			31=> '支付宝扫码充值',	
			32=> '支付宝手机订单支付',
			33=> '支付宝手机充值',
			34=> '支付宝退款',			
		];
		
        return $list;
	}
	
	
	
	//接口请求方式
	public static function requestList(){
		
		$list=['post','get','delete','put','header'];
		
        return $list;
	}
	
	
}
